
# 1.
# while ...: До като е True, кода се изпълнява!
    #code

# 2.
# number = 5
# while number < 50:  # While True: - Може и така директно да се изпише!
#     print(number)
# ВНИМАВАЙ - това е безкраен цикъл без да може да се спре!!!

# 3.
# number = 5
# while number < 50:
#     print(number)
#     number += 1
# Това ще отпечати числата от 5 до 49 и ще спре! При достигане на 50 става False и спира!!!

# 4.
# number = 5
# while True: - НЕ Е ДОБРА ПРАКТИКА ДА СЕ ПИШЕ ТАКА!!!
#     print(number)
#     number += 1
#     if number == 50:
#         break # Отнася се само за цикъла, в чието тяло се намира!!!
# Така ще се спре цикъла при достигане на 50!!! Брейк се слага навътре в конструкцията!

# 5.
# a = 5
# while a <= 10:
#     print("a = " + str(a))
#     a += 1
# Ще отпечати а = 5, а = 6 до а = 10 и ще спре!

# 6.
# text = input()
# while text != "Stop":
#     print(text)
#     text = input()
# Винаги първоначалната команда се пише най-отдолу за да завърти цикъла, до като не получи Stop!!!

#  7. Като горната логика:
# while True:
#     text = input()
#     if text == "Stop":
#         break
#     print(text)
# Цикъла се затваря с последната команда до като не получи Stop!!!

# 8.
# continue се ползва вместо else след break