# ИТЕРАЦИЯ - БРОЙ ЦИКЛИ! РАБОТИ САМО С ЦЕЛИ ЧИСЛА! ЗНАЕМ КОЛКО СА ИТЕРАЦИИТЕ!

# 1.
# Само цели числа и задължително диапазон (Start, End, Step)
# При използване на стъпка ВИНАГИ ИМАМЕ И ТРИТЕ ЕЛЕМЕНТА
# for number in range (1, 10) e if 1<= number <10  (range РАБОТИ С ЧИСЛА)
# for number in range(10) e (0, 10, 1) = 0123456789

# 2.
# Може и обратно да смята: Ще отпечати числата от 10 до 1 в обратен ред:
# for i in range(10, 0, -1):
#     print(i)

# 3.
# Може да обхожда стрингове(текст):
# for i in "This is string": БЕЗ КАВИЧКИ
#     print(i, end=" ")
# end=" " нарежда символите хоризонтално на същия ред

# 4.
# for _ in range(1, 11):
#     print("Hello Softuni!")
# Ще отпечати 10 пъти Hello Softuni

# 5.
# Вложен цикъл с for loops:
# for hours in range(0, 24):
#     for minutes in range(0, 60):
#         for seconds in range(0, 60):
#             print(f"Current time is: {hours:02d}:{minutes:02d}:{seconds:02d}")
# :02d дава водеща нула в двуцифрено число в случая

# 6.
# print(list(range(1, 11)))
# Ще отпечата списъка с числа така: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# 7.
# a = range(1, 11)
# for num in a:
#     print(num)
# Пак отпечатва числата от едно до десет!

# 8.
# Индексиране
# (TEXT = 0,1,2,3) машината подрежда буквите в този ред от нула, може и обратно от -1
# print(TEXT[1]) ще отпечати Е, защото E е втора буква, но чете от нула!
# text = input()
# print(text[1])
# В случая ще отпечати втората буква от въведения текст!

# 9. print(len(some_text)) ще принтира броя на буквите в текста,
# изчислява колко са като бройка, включително интервалите:

# x = len("Hello")
# print(x)
# Ще върне отговор 5! Толкова са символите в "Hello"!

# mylist = ["apple", "orange", "cherry"]
# x = len(mylist)
# print(x)
# Ще върне отговор 3! Толкова са ОБЕКТИТЕ като стрингове в скобите!

# 10.
# for i in range(97, 100):
#     print(chr(i))
# Това ще върне a, b, c! chr(character) - превръща от числа в символи!
# Виж аски таблицата кой символ на какво отговаря! И е int - ЗАПОМНИ








